Revit 2027 API
MessageBoxData.DialogType Property
 An integer that describes the standard windows type of the dialog box.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int DialogType { get; }
Public ReadOnly Property DialogType As Integer
	Get
public:
property int DialogType {
	int get ();
}
member DialogType : int with get
Property Value
Int32
See Also
Reference
MessageBoxData Class
Autodesk.Revit.UI.Events Namespace